package com.giudeMuslim.mauqetAlsallah.service;

import org.springframework.stereotype.Service;
import java.util.Random;


@Service
public class AzkarService {


    public String RandomZikr() {
        String[] azkar = {
                "استغفر الله العظيم",
                "سبحان الله وبحمده",
                "الحمد لله رب العالمين",
                "الله أكبر",
                "سبحان الله وبحمده سبحان الله العظيم",
                "لا حول ولا قوة إلا بالله",
                "سبحان الله العظيم",
                "حسبنا الله ونعم الوكيل",
                "لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شئ قدير",
                "اللهم إني أعوذ بك من الهم والحزن",
                "اللهم إني أعوذ بك من العجز والكسل",
                "اللهم إني أعوذ بك من الجبن والبخل",
                "اللهم إني أعوذ بك من غلبة الدين وقهر الرجال",
                "رضيت بالله رباً وبالإسلام ديناً وبمحمدٍ صلى الله عليه وسلم نبياً ورسولا",
                "اللهم اجعلني من الذين يستمعون القول فيتبعون أحسنه",
                "اللهم ارزقني قلباً خاشعاً ولساناً صادقاً وعملاً متقبلاً",
                "سبحان الله وبحمده سبحان الله العظيم"
        };

        return azkar[new Random().nextInt(azkar.length)];
    }


    public String salyAlaELnaby() {
        return "صَلِّ على النبي ﷺ";
    }
}
