package com.giudeMuslim.mauqetAlsallah.service;

import org.springframework.stereotype.Service;

import java.util.Random;
@Service
public class DauService {

    public String getRandomDua() {
        String[] duas = {
                "اللهم إنك عفو تحب العفو فاعف عنا",
                "ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار",
                "اللهم إني أسألك الهدى والتقى والعفاف والغنى",
                "يا مقلب القلوب ثبت قلبي على دينك",
                "اللهم اغفر لي وارحمني واهدني وعافني وارزقني",
                "اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل",
                "رب اشرح لي صدري ويسر لي أمري",
                "اللهم اغفر لي",
                "اللهم ارحمني",
                "يا رب لك الحمد كما ينبغي لجلال وجهك وعظيم سلطانك",
                "رب اغفر لي وتب عليّ إنك أنت التواب الرحيم",
                "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء",
                "اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك"
        };
        return duas[new Random().nextInt(duas.length)];
    }
}
